#pragma once
/*=======================================================
*		o(*￣▽￣*)o
*		FileName：Menu.h -- 菜单
*		Start Date：2020/06/11
*		Last UpDate：2020/06/15
*=======================================================*/

#include <iostream>
using namespace std;

/*=======================================================
*	函数功能：程序开始菜单
*	参数：无
*	返回值：无
*	警告：无
*	更新：2020/06/15
========================================================*/
void Menu()
{
	cout << "---------- 学生管理系统 ----------" << endl;
	cout << endl;
	cout << "\t0. 退出程序" << endl;
	cout << "\t1. 添加学生信息" << endl;
	cout << "\t2. 删除学生信息" << endl;
	cout << "\t3. 修改学生信息" << endl;
	cout << "\t4. 查询学生信息" << endl;
	cout << endl;
	cout << "请输入 0~4 进行相应的功能操作：";
}


/*=======================================================
*	函数功能：查询功能菜单
*	参数：无
*	返回值：无
*	警告：无
*	更新：2020/06/15
========================================================*/
void InquireMenu()
{
	cout << "---------- 查询学生数据 ----------" << endl;
	cout << endl;
	cout << "\t0. 退出程序" << endl;
	cout << "\t1. 输入学生ID查询学生数据" << endl;
	cout << "\t2. 输入学生姓名查询相关的学生数据" << endl;
	cout << endl;
	cout << "请输入 0~2 进行相应的功能操作：";
}